{
    "development": {
        "config_id": "development",
        "app_name": "RobotachWeb",
        "app_desc": "Robotach (Private) Limited company website.",
        "node_port": 3000,
        "json_indentation": 4,
        "database": "robotachweb-dev"
    },
    "testing": {
        "config_id": "testing",
        "database": "robotachweb-test"
    },
    "staging": {
        "config_id": "staging",
        "node_port": 8081,
        "database": "robotachweb-stag"
    },
    "production": {
        "config_id": "production",
        "app_name": "RobotachWeb",
        "app_desc": "Robotach (Private) Limited company website.",        
        "node_port": 8080,
        "json_indentation": 4,
        "database": "robotachweb-prod",
        "info_email": "info@robotach.io",
        "main_phone": "+44 741 848 9587",
        "main_fax": "not available",
        "company_address": "Stadium Commercial Area, Phase V, DHA, Karachi-75500, Pakistan.",
        "api_user": "musama",
        "api_pwd" : "uJtU4Mnxyk121125uk1bT3HQ6SMg",
        "company_twitter_name": "Robotachio",
        "company_twitter_url": "https://twitter.com/Robotachio",
        "company_instagram_url": "https://www.instagram.com/robotachio/?hl=en",
        "company_linkedin_url": "https://www.linkedin.com/company/robotach/",
        "company_facebook_url": "https://www.facebook.com/robotach",
        "company_skype_url": "skype:usamakhan1984@hotmail.com?chat",
        "company_youtube_url":"https://www.youtube.com/channel/UCE6eSORP3VY97SYfJlFPTiA",
        "home_welcome_title": "Welcome To Robotach (IoT, IIoT, Robotics & Blockchain)",
        "home_welcome_message" : "We are a leading hardware development, software development, and consultancy firm. We provide consultation and develop IoT, IIoT, Robotics and Blockchain based systems for businesses. We have skills and knowledge of system automation either software or hardware. Our customers are our top priority.",
        "home_slider1_caption_p1":"Building",
        "home_slider1_caption_p2":"Awesome",
        "home_slider1_caption_p3":"Systems",
        "home_slider1_caption_pra":"We at Robotach make really smart and <br/> amazing systems. This can be used to describe <br/> what you do, how you do it, and who you do it for.",
        "home_slider2_caption_p1":"Lets Automate",
        "home_slider2_caption_p2":"& Experience",
        "home_slider2_caption_p3":"Growth!",
        "home_slider2_caption_pra":"It can be a daunting task to put labor for every task, <br/>  this is the common challenge for every business and this <br/> impacts cost and performance. Automation is the answer.",
        "home_slider3_caption_p1":"Have",
        "home_slider3_caption_p2":"A Burning",
        "home_slider3_caption_p3":"Question ?",
        "home_slider3_caption_pra":"At Robotach customers are the top priority, we are <br/> available here to answer your queries within 24 hours time. <br/>  Alternatively, you may call us we are happy to serve you at our best.",
        "home_service1_caption": "IoT",
        "home_service1_para": "Robotach is working on embedded systems for a long time and continues to deliver cutting-edge IoT products and solutions to its customers. We work on any project that has potential no matter how big or small the project is.",
        "home_service2_caption": "IIoT",
        "home_service2_para": "The industrial internet of things, or IIoT, is the use of internet of things technologies to enhance manufacturing and industrial processes. Also known as the industrial internet or Industry 4.0, we at Robotach developed M2M (machine-to-machine) and various different types of solutions for our clients and customers.",
        "home_service3_caption": "Robotics",
        "home_service3_para": "By the passage of time Robotics becomes a necessity for mankind from your automated dish-washer (consumer) to automated car manufacturing factories (production) and so on the use of robots has become common, and Robotach is aware of this increasing demand to produce smart robots who serve or customers with intelligence and safety.",
        "home_service4_caption": "Blockchain",
        "home_service4_para": "Blockchain technology is a big revolution and we are ahead of it we utilize many smart contracts and protocols to integrate blockchain with our IoT solutions to serve our customers/client's needs.",
        "home_projects_main_msg": "Browse our recent projects and you will see how we work and what are the different technologies we use to build solutions with high quality to meet client requirements, All we aim is to make our customers satisfied and happy with all of our services.",
        "home_project1_Title":"Live Audio",
        "home_project1_Category":"IoT",
        "home_project2_Title":"M2M",
        "home_project2_Category":"IIoT",
        "home_project3_Title":"Nano Robot",
        "home_project3_Category":"Robotics",
        "home_project4_Title":"Big Cypher",
        "home_project4_Category":"Blockchain",
        "home_project5_Title":"Rig",
        "home_project5_Category":"Blockchain",
        "about_intro_para": "Robotach has started its operation in 2008 and continues to deliver products and services across different business sectors. We provide cutting-edge solutions to our customers and clients, our customers are our top priority. we deal in IoT, IIoT, Robotics, and Blockchain solutions.",
        "about_services1_name": "IoT",
        "about_services1_desc": "The Internet of Things (IoT) refers to the use of intelligently connected devices and systems to leverage data gathered by embedded sensors and actuators in machines and other physical objects. In other words, the IoT (Internet of Things) can be called to any of the physical objects connected with the network.",
        "about_services2_name": "IIoT",
        "about_services2_desc": "The industrial internet of things, or IIoT, is the use of internet of things technologies to enhance manufacturing and industrial processes. Also known as the industrial internet or Industrie 4.0, IIoT incorporates machine learning and big data technologies to harness the sensor data, machine-to-machine (M2M) communication, and automation technologies that have existed in industrial settings for years.",
        "about_services3_name": "Robotics",
        "about_services3_desc": "Robotics deals with the design, construction, operation, and use of robots, as well as computer systems for their control, sensory feedback, and information processing. These technologies are used to develop machines that can substitute for humans and replicate human actions. There is an increasing demand for Robotics systems like working in a hazardous area, military systems and automated systems, etc.",
        "about_services4_name": "Blockchain",
        "about_services4_desc": "<p>A blockchain is the structure of data that represents a financial ledger entry, or a record of a transaction. Each transaction is digitally signed to ensure its authenticity and that no one tampers with it, so the ledger itself and the existing transactions within it are assumed to be of high integrity.</p><p>The real magic comes, however, from these digital ledger entries being distributed among a deployment or infrastructure. These additional nodes and layers in the infrastructure serve the purpose of providing a consensus about the state of a transaction at any given second; they all have copies of the existing authenticated ledger distributed amongst them.</p>",
        "about_mission": "To provide products and services of international standards to customers with the highest level of satisfaction.",
        "about_vision": "Growth with diversification fulfilling the aspiration and expectation of stakeholders with a significant contribution to the nation's economy.",
        "about_strategy": "The company remains focused on its core business of IoT, IIoT, System Integration, Robotics, and Blockchain while diversifying itself into new business areas of Artificial Intelligence, Big Data, and Manufacturing.",
        "contactus_message": "Customers are our top priority. You can send us your queries using the contact form. Alternatively, you can contact us using below mentioned contact information.",
        "contactus_maps_key": "https://maps.google.com/maps/api/js?sensor=false&key=AIzaSyDdqwRQMi38E73cLRCi93VUk-545E_B9e4",
        "contactus_mapmarker_LatLng": "24.81364,67.0481698",
        "contactus_mapmarker_address": "Stadium Commercial Area, Phase V, DHA, * Karachi-75500, Pakistan.",
        "contactus_email_host":"robotach.io",
        "contactus_email_port":"465",
        "contactus_email_secure":"true",
        "contactus_additional_email":"consultants_solutions@hotmail.com",
        "contactus_cc_emailadds":"",
        "contactus_bcc_emailadds":"",
        "contactus_email_uauth":"mailer@robotach.io",
        "contactus_email_psecure":"lKespdFYzkyptkLlNoVt2Q==",
        "privacy_policy": [
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Introduction</h3>",
            "<p>Robotach Private Limited (''us'', ''we'', or ''our'') operates the robotach.io website (the ''Service'').</p>",
            "<p>This page informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Service and the choices you have associated with that data.</p>",
            "<p>We use your data to provide and improve the Service. By using the Service, you agree to the collection and use of information in accordance with this policy. Unless otherwise defined in this Privacy Policy, terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, accessible from robotach.io</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Information Collection And Use</h3>",
            "<p>We collect several different types of information for various purposes to provide and improve our Service to you.</p>",
            "<h4 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Types of Data Collected</h4>",
            "<h5 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Personal Data</h5>",
            "<p>While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you (''Personal Data''). Personally identifiable information may include, but is not limited to:</p>",
            "<ul><li>Email address</li><li>First name and last name</li><li>Phone number</li><li>Address, State, Province, ZIP/Postal code, City</li><li>Cookies and Usage Data</li></ul><br/>",
            "<h5 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Usage Data</h5>",
            "<p>We may also collect information how the Service is accessed and used (''Usage Data''). This Usage Data may include information such as your computer's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.</p>",
            "<h5 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Tracking &amp; Cookies Data</h5>",
            "<p>We use cookies and similar tracking technologies to track the activity on our Service and hold certain information.</p>",
            "<p>Cookies are files with small amount of data which may include an anonymous unique identifier. Cookies are sent to your browser from a website and stored on your device. Tracking technologies also used are beacons, tags, and scripts to collect and track information and to improve and analyze our Service.</p>",
            "<p>You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our Service.</p>",
            "<p>Examples of Cookies we use:</p><ul>",
            "<li><strong>Session Cookies.</strong> We use Session Cookies to operate our Service.</li>",
            "<li><strong>Preference Cookies.</strong> We use Preference Cookies to remember your preferences and various settings.</li>",
            "<li><strong>Security Cookies.</strong> We use Security Cookies for security purposes.</li></ul><br/>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Use of Data</h3>",                
            "<p>Robotach Private Limited uses the collected data for various purposes:</p>",    
            "<ul><li>To provide and maintain the Service</li><li>To notify you about changes to our Service</li>",
            "<li>To allow you to participate in interactive features of our Service when you choose to do so</li>",
            "<li>To provide customer care and support</li><li>To provide analysis or valuable information so that we can improve the Service</li>",
            "<li>To monitor the usage of the Service</li><li>To detect, prevent and address technical issues</li></ul><br/>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Transfer Of Data</h3>",
            "<p>Your information, including Personal Data, may be transferred to — and maintained on — computers located outside of your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from your jurisdiction.</p>",
            "<p>If you are located outside Pakistan and choose to provide information to us, please note that we transfer the data, including Personal Data, to Pakistan and process it there.</p>",
            "<p>Your consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.</p>",
            "<p>Robotach Private Limited will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this Privacy Policy and no transfer of your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of your data and other personal information.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Disclosure Of Data</h3>",
            "<h4 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Legal Requirements</h4>",
            "<p>Robotach Private Limited may disclose your Personal Data in the good faith belief that such action is necessary to:</p>",
            "<ul><li>To comply with a legal obligation</li><li>To protect and defend the rights or property of Robotach Private Limited</li>",
            "<li>To prevent or investigate possible wrongdoing in connection with the Service</li><li>To protect the personal safety of users of the Service or the public</li>",
            "<li>To protect against legal liability</li></ul><br/>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Security Of Data</h3>",
            "<p>The security of your data is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Service Providers</h3>",
            "<p>We may employ third party companies and individuals to facilitate our Service (''Service Providers''), to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.</p>",
            "<p>These third parties have access to your Personal Data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Analytics</h3>",
            "<p>We may use third-party Service Providers to monitor and analyze the use of our Service.</p>",    
            "<ul><li><p><strong>Google Analytics</strong></p>",
            "<p>Google Analytics is a web analytics service offered by Google that tracks and reports website traffic. Google uses the data collected to track and monitor the use of our Service. This data is shared with other Google services. Google may use the collected data to contextualize and personalize the ads of its own advertising network.</p>",
            "<p>You can opt-out of having made your activity on the Service available to Google Analytics by installing the Google Analytics opt-out browser add-on. The add-on prevents the Google Analytics JavaScript (ga.js, analytics.js, and dc.js) from sharing information with Google Analytics about visits activity.</p><p>For more information on the privacy practices of Google, please visit the Google Privacy &amp; Terms web page: <a href='https://policies.google.com/privacy?hl=en'>link</a></p></li></ul>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Links To Other Sites</h3>",
            "<p>Our Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.</p>",
            "<p>We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Children's Privacy</h3>",
            "<p>Our Service does not address anyone under the age of 18 (''Children'').</p>",
            "<p>We do not knowingly collect personally identifiable information from anyone under the age of 18. If you are a parent or guardian and you are aware that your Children has provided us with Personal Data, please contact us. If we become aware that we have collected Personal Data from children without verification of parental consent, we take steps to remove that information from our servers.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Changes To This Privacy Policy</h3>",
            "<p>We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.</p>",
            "<p>We will let you know via email and/or a prominent notice on our Service, prior to the change becoming effective and update the ''effective date'' at the top of this Privacy Policy.</p>",
            "<p>You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Contact Us</h3><p>If you have any questions about this Privacy Policy, please contact us:</p>",
            "<ul><li>By email: info@robotach.io</li><li>By visiting this page on our website: http://robotach.io/contactus</li></ul>",            
            "<br/><p>Effective date: December 27, 2018</p>",
            "Our Privacy Policy for Robotach Private Limited is based on <a href='https://www.freeprivacypolicy.com/blog/sample-privacy-policy-template/'>link</a>"
        ],
        "terms_of_use":[
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Introduction</h3>",
            "<p>These Website Standard Terms and Conditions written on this webpage shall manage your use of our website, robotach accessible at http://robotach.io/.</p>",
            "<p>These Terms will be applied fully and affect to your use of this Website. By using this Website, you agreed to accept all terms and conditions written in here. You must not use this Website if you disagree with any of these Website Standard Terms and Conditions.</p>",
            "<p>Minors or people below 18 years old are not allowed to use this Website.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Intellectual Property Rights</h2>",
            "<p>Other than the content you own, under these Terms, Robotach and/or its licensors own all the intellectual property rights and materials contained in this Website.</p>",
            "<p>You are granted limited license only for purposes of viewing the material contained on this Website.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Restrictions</h3>",
            "<p>You are specifically restricted from all of the following:</p>",
            "<ul><li>publishing any Website material in any other media;</li>",
            "<li>selling, sublicensing and/or otherwise commercializing any Website material;</li>",
            "<li>publicly performing and/or showing any Website material;</li>",
            "<li>using this Website in any way that is or may be damaging to this Website;</li>",
            "<li>using this Website in any way that impacts user access to this Website;</li>",
            "<li>using this Website contrary to applicable laws and regulations, or in any way may cause harm to the Website, or to any person or business entity;</li>",
            "<li>engaging in any data mining, data harvesting, data extracting or any other similar activity in relation to this Website;</li>",
            "<li>using this Website to engage in any advertising or marketing.</li></ul>",
            "<p>Certain areas of this Website are restricted from being access by you and Robotach may further restrict access by you to any areas of this Website, at any time, in absolute discretion. Any user ID and password you may have for this Website are confidential and you must maintain confidentiality as well.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Your Content</h3>",
            "<p>In these Website Standard Terms and Conditions, ''Your Content'' shall mean any audio, video text, images or other material you choose to display on this Website. By displaying Your Content, you grant Robotach a non-exclusive, worldwide irrevocable, sub licensable license to use, reproduce, adapt, publish, translate and distribute it in any and all media.</p>",
            "<p>Your Content must be your own and must not be invading any third-party’s rights. Robotach reserves the right to remove any of Your Content from this Website at any time without notice.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Your Privacy</h3>",
            "<p>Please read <a href='/privacypolicy'>our Privacy Policy</a>.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>No warranties</h3>",
            "<p>This Website is provided ''as is,'' with all faults, and Robotach express no representations or warranties, of any kind related to this Website or the materials contained on this Website. Also, nothing contained on this Website shall be interpreted as advising you.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Limitation of liability</h2>",
            "<p>In no event shall Robotach, nor any of its officers, directors and employees, shall be held liable for anything arising out of or in any way connected with your use of this Website whether such liability is under contract.  Robotach, including its officers, directors and employees shall not be held liable for any indirect, consequential or special liability arising out of or in any way related to your use of this Website.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Indemnification</h2>",
            "<p>You hereby indemnify to the fullest extent Robotach from and against any and/or all liabilities, costs, demands, causes of action, damages and expenses arising in any way related to your breach of any of the provisions of these Terms.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Severability</h3>",
            "<p>If any provision of these Terms is found to be invalid under any applicable law, such provisions shall be deleted without affecting the remaining provisions herein.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Variation of Terms</h3>",
            "<p>Robotach is permitted to revise these Terms at any time as it sees fit, and by using this Website you are expected to review these Terms on a regular basis.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Assignment</h3>",
            "<p>The Robotach is allowed to assign, transfer, and subcontract its rights and/or obligations under these Terms without any notification. However, you are not allowed to assign, transfer, or subcontract any of your rights and/or obligations under these Terms.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Entire Agreement</h3>",
            "<p>These Terms constitute the entire agreement between Robotach and you in relation to your use of this Website, and supersede all prior agreements and understandings.</p>",
            "<h3 class='fx animated fadeInLeft' data-animate='fadeInLeft'>Governing Law & Jurisdiction</h3>",
            "<p>These Terms will be governed by and interpreted in accordance with the laws of the State of Pk, and you submit to the non-exclusive jurisdiction of the state and federal courts located in Pk for the resolution of any disputes.</p>",
            "<p>ToS Credits:<a href='https://termsandcondiitionssample.com'>link</a></p>",
            "<p>Image Credits:<a href='https://www.freepik.com'>freepik</a></p>",
            "<ul><li><a href='https://www.freepik.com/photos/technology'>Photo by rawpixel.com</a></a></li><li><a href='https://www.freepik.com/photos/lines'>Photo by vanitjan</a></a></li><li><a href='https://www.freepik.com/photos/technology'>Photo by DCStudio</a></li></ul>"
            
        ]
    }
}
